{
  "Layout": {
    "defaultTitle": "Walter Greenwich",
    "pageTitle": "Full-Stack Developer Portfolio"
  },
  "Home": {
    "pageTitle": "Full-Stack Developer Portfolio",
    "title": "Transforming Ideas Into Intelligent Systems.",
    "description": "Full Stack Developer Specializing in Applied AI. Combining React, Python, and LLMs to create intelligent products  that automate, analyze, and decide.",
    "cvLink": "https://drive.google.com/file/d/15m9EpQ8cxEU3Pi_TK1npq9nvkpzq8n8N/view?usp=sharing"
  },
  "LocaleSwitcher": {
    "switchLocale": "Switch to {locale, select, es {Spanish} en {English} other {Unknown}}"
  },

  "Navbar": {
    "Home": "Home",
    "About": "About",
    "Projects": "Projects",
    "Contact": "Contact"
  },
  "Footer": {
    "madeWith": "Made with",
    "by": "by"
  },
  "About": {
    "pageTitle": "About",
    "title": "Building The Future of Intelligent Applications",
    "biography": "BIOGRAPHY",
    "p1": "I'm Walter Greenwich, a Full Stack Developer who combines modern web development with applied artificial intelligence to create solutions that truly transform operations.",
    "p2": "My Unique Approach: I don't just build pretty interfaces or scalable backends - I create complete systems where AI solves real business problems. While most developers integrate AI APIs as just another feature, I design AI-first architectures where artificial intelligence is the core engine of the solution.",
    "p3": "From Science to Code: My scientific background taught me to analyze problems systematically. My sales experience gave me the ability to understand real user needs and communicate technical solutions clearly. Now I apply both perspectives to build products people actually want to use.",
    "pCompleted": "Projects Completed"
  },
  "Skills": {
    "title": "Skills"
  },
  "Education": {
    "title": "Education",
    "certificate": "Certificate"
  },
  "Projects": {
    "pageTitle": "Projects",
    "title": "Dream it. Build it. Live it",
    "type": "Featured Project",
    "summary0": "Automating WhatsApp message handling using n8n. This system receives messages via WhatsApp webhooks, processes messages with routing logic, and responds automatically based on keywords., and stores the results in a PostgreSQL database for further analysis.",
    "summary1": "Intelligent email classification and analysis using Google Gemini 2.0 Flash. This system automatically categorizes emails, assesses urgency, extracts intent, and suggests actions—going beyond simple rule-based classification.",
    "summary2": "An elegant and efficient movie search platform built with React.js, Appwrite, and Tailwind CSS. It features real-time movie data from the TMDB API and optimized search performance with useDebounce for smooth input handling.",
    "summary3": "A visually appealing and easy-to-use restaurant website built with React.js and Tailwind CSS. It displays the restaurant's menu, photo gallery, and contact information in a clear and accessible way."
  },
  "Contact": {
    "pageTitle": "Contact",
    "title": "Ready To Build Something Extraordinary?",
    "description1": "Have A Project Where AI Can Make A Real Difference?",
    "description2": "I'm not looking for just 'another job'- I'm looking for interesting problems to solve with intelligent technology. If your project needs:",
    "description3": [
      "Automation that actually saves time (not just automates for the sake of it).",
      "Systems that process and understand unstructured data.",
      "Applications where AI is fundamental, not just another feature.",
      "A developer who builds the complete product (backend + AI + frontend)."
    ],
    "description4": "Let’s talk. I combine clean code with clear communication and a passion for solving complex problems. If you value dedication and tangible results, let’s build something impactful together.",
    "baseIn": "Currently based in",
    "dCV": "Download CV",
    "cvLink": "https://drive.google.com/file/d/15m9EpQ8cxEU3Pi_TK1npq9nvkpzq8n8N/view?usp=sharing"
  }
}
