{
  "Layout": {
    "defaultTitle": "Walter Greenwich",
    "pageTitle": "Portafolio de Desarrollador Full-Stack"
  },
  "Home": {
    "pageTitle": "Portafolio de Desarrollador Full-Stack",
    "title": "Transformando Ideas En Sistemas Inteligentes",
    "description": "Desarrollador Full Stack especializado en IA Aplicada. Combino React, Python y LLMs para crear productos inteligentes que automatizan, analizan y deciden.",
    "cvLink": "https://drive.google.com/file/d/1PnW4GG7Dy8ic8E4NkU4LMDEXkBmm42S9/view?usp=sharing"
  },
  "LocaleSwitcher": {
    "switchLocale": "Switch to {locale, select, en {English} es {Spanish} other {Unknown}}"
  },

  "Navbar": {
    "Home": "Inicio",
    "About": "Sobre mí",
    "Projects": "Proyectos",
    "Contact": "Contacto"
  },
  "Footer": {
    "madeWith": "Hecho con",
    "by": "por"
  },
  "About": {
    "pageTitle": "Sobre mí",
    "title": "Construyendo El Futuro de las Aplicaciones Inteligentes",
    "biography": "BIOGRAFIA",
    "p1": "Hola, soy Walter Greenwich, desarrollador frontend especializado en crear sitios web modernos, visualmente atractivos e intuitivos, centrados en el usuario.",
    "p2": "Con formación científica y experiencia como representante de ventas, he perfeccionado mis habilidades de comunicación, resolución de problemas y gestión de proyectos. Me especializo en React, Tailwind CSS y Next.js para crear soluciones digitales optimizadas y de alto rendimiento.",
    "p3": "Me apasiona mantenerme al día con las últimas novedades en desarrollo web, desde landing pages hasta plataformas de comercio electrónico. Aporto a cada proyecto mi pasión por el diseño responsivo y el pensamiento centrado en el usuario. Colaboremos para hacer realidad tu visión.",
    "pCompleted": "Proyectos Completados"
  },
  "Skills": {
    "title": "Habilidades"
  },
  "Education": {
    "title": "Educación",
    "certificate": "Certificado"
  },
  "Projects": {
    "pageTitle": "Proyectos",
    "title": "Suéñalo. Constrúyelo. Vívelo",
    "type": "Proyecto Destacado",
    "summary0": "Automatización del manejo de mensajes de WhatsApp utilizando n8n. Este sistema recibe mensajes a través de webhooks de WhatsApp, procesa los mensajes con lógica de enrutamiento y responde automáticamente según palabras clave, y almacena los resultados en una base de datos PostgreSQL para su posterior análisis.",
    "summary1": "Clasificación y análisis inteligente de correos electrónicos con Google Gemini 2.0 Flash. Este sistema categoriza automáticamente los correos electrónicos, evalúa la urgencia, extrae la intención y sugiere acciones, yendo más allá de la simple clasificación basada en reglas.",
    "summary2": "Una plataforma de búsqueda de películas elegante y eficiente, desarrollada con React.js, Appwrite y Tailwind CSS. Ofrece datos de películas en tiempo real de la API de TMDB y un rendimiento de búsqueda optimizado con useDebounce para una gestión fluida de la entrada.",
    "summary3": "Un sitio web de restaurante visualmente atractivo y fácil de usar, creado con React.js y Tailwind CSS. Muestra el menú, la galería de fotos y la información de contacto del restaurante de forma clara y accesible."
  },
  "Contact": {
    "pageTitle": "Contacto",
    "title": "Contacto",
    "description1": "¿Tienes un proyecto donde la IA puede marcar una diferencia real?",
    "description2": "No solo busco 'otro trabajo', busco problemas interesantes que resolver con tecnología inteligente. Si tu proyecto necesita:",
    "description3": [
      "Automatización que realmente ahorra tiempo (no solo automatizar por automatizar).",
      "Sistemas que procesan y entienden datos no estructurados.",
      "Aplicaciones donde la IA es fundamental, no solo una característica más.",
      "Un desarrollador que construye el producto completo (backend + IA + frontend)."
    ],
    "description4": "Entonces Hablemos. Combino código limpio con una comunicación clara y pasión por resolver problemas complejos. Si valoras la dedicación y los resultados tangibles, construyamos algo impactante juntos.",
    "baseIn": "Actualmente estoy en",
    "dCV": "Descargar CV",
    "cvLink": "https://drive.google.com/file/d/1PnW4GG7Dy8ic8E4NkU4LMDEXkBmm42S9/view?usp=sharing"
  }
}
